[
  {
    "caseId": "2024_00096",
    "summary": "The perjury counts were multiplicitous, creating an impermissible risk of multiple convictions for the same conduct, so one count had to be vacated. The claim that a witness improperly instructed the jury on materiality did not warrant relief, and remaining claims were unpreserved."
  },
  {
    "caseId": "2024_00097",
    "summary": "Police lacked reasonable suspicion to detain defendant, and the People failed to prove that contraband was in plain view. The ensuing vehicle search was unconstitutional, requiring suppression of the recovered weapon."
  },
  {
    "caseId": "2024_00158",
    "summary": "The appeal waiver was invalid under Thomas/Bisono and could not bar review. The case was sent back for consideration of the excessive-sentence claim on the merits."
  },
  {
    "caseId": "2024_00792",
    "summary": "The evidence supported a finding that defendant violated Vehicle and Traffic Law § 600 (2) (a) by leaving the scene of an incident involving injury. The sufficiency challenge therefore failed."
  },
  {
    "caseId": "2024_00848",
    "summary": "COVID-era masking and distancing during voir dire did not violate the right to be present or due process. The Constitution does not require a simultaneous, unobstructed view of every juror’s full face throughout jury selection."
  },
  {
    "caseId": "2024_00849",
    "summary": "The trial court gave a meaningful response to a jury note and was not required to reinstruct on justification. The due-process challenge to the interested-witness charge was unpreserved."
  },
  {
    "caseId": "2024_00850",
    "summary": "Courts may modify securing orders for defendants charged with new violent felonies under CPL 530.60 (1) or (2) (a), but a CPL 530.60 (1) ruling must be grounded in flight-risk factors. Where the record does not show that basis, the proceeding is treated under CPL 530.60 (2) (a) and noncompliance with its procedures is error, warranting declaratory relief rather than habeas."
  },
  {
    "caseId": "2024_00926",
    "summary": "Due process does not require a competency hearing before a SORA risk-level determination when the offender is represented by counsel and afforded SORA’s procedural safeguards. The statutory protections adequately balance the competing interests and minimize error risk."
  },
  {
    "caseId": "2024_00927",
    "summary": "The People were entitled to request a lesser-included second-degree burglary charge even though the indictment alleged a sexually motivated felony. Defendant had adequate notice of the lesser offense, and the trial court’s submission of that charge did not violate due process."
  },
  {
    "caseId": "2024_00928",
    "summary": "SORA’s 30-day classification deadline is measured from release by DOCCS, even when civil commitment proceedings under SOMTA are pending. Holding the SORA hearing at that time does not violate due process."
  },
  {
    "caseId": "2024_01499",
    "summary": "For torture murder, the “course of conduct” element may be satisfied by a series of acts inflicting extreme pain, but the People must also prove the defendant relished the infliction of that pain. The evidence supported a course of conduct but not the “relish” element in this case."
  },
  {
    "caseId": "2024_01500",
    "summary": "The evidence was sufficient for a rational jury to find the “torture” aggravator, including that defendant relished or took pleasure in inflicting extreme physical pain. The abusive relationship and conduct supported that inference."
  },
  {
    "caseId": "2024_01582",
    "summary": "Under CPL 30.30, the People’s unexplained lack of readiness made the entire 43-day adjournment chargeable. The misdemeanor prosecution therefore exceeded the statutory time limit."
  },
  {
    "caseId": "2024_02083",
    "summary": "The sentencing court conducted a sufficient Outley inquiry into an alleged plea violation and gave defendant an opportunity to contest the factual basis. Ineffective-assistance claims were deemed more appropriate for collateral review."
  },
  {
    "caseId": "2024_02084",
    "summary": "Applying Boone, the challenge to a SORA classification proceeding held in proximity to release and potential civil commitment was rejected. The timing and due-process arguments were foreclosed by that precedent."
  },
  {
    "caseId": "2024_02125",
    "summary": "Non-eyewitness identification testimony is admissible only when the witness is sufficiently familiar with the defendant and the jury needs assistance. Those predicates were not met, so the identification testimony should have been excluded."
  },
  {
    "caseId": "2024_02128",
    "summary": "An undercover officer’s in-court identification required an independent-source determination based on a proper hearing record. Reliance on prior probable-cause testimony was insufficient, necessitating a new independent-source hearing before retrial."
  },
  {
    "caseId": "2024_02129",
    "summary": "A juror who believed defendant followed her home, delayed reporting, and expressed fear during deliberations was grossly unqualified. The court’s later assurances did not cure that disqualification."
  },
  {
    "caseId": "2024_02130",
    "summary": "Removing defendant from the courtroom during the verdict and jury polling did not violate the right to be present because a prior warning was not practicable in the circumstances. Appellate counsel was not ineffective for omitting that claim."
  },
  {
    "caseId": "2024_02222",
    "summary": "The trial court improperly admitted extensive uncharged sexual-act evidence and permitted cross-examination on highly prejudicial allegations without a proper non-propensity purpose. Those rulings bolstered complainants’ credibility, undermined defendant’s right to testify, and were not harmless."
  },
  {
    "caseId": "2024_02225",
    "summary": "The People established a legally adequate chain of custody for the cocaine. The foundational showing provided reasonable assurance of the evidence’s identity and unchanged condition."
  },
  {
    "caseId": "2024_02227",
    "summary": "The Criminal Justice Agency report was not created for the primary purpose of trial testimony and therefore was non-testimonial. Its admission did not trigger the Confrontation Clause."
  },
  {
    "caseId": "2024_02725",
    "summary": "An officer’s conclusory observation of “excessively tinted” windows, without objective details or testing, did not establish probable cause for a traffic stop. The stop was unlawful and the resulting evidence had to be suppressed."
  },
  {
    "caseId": "2024_02765",
    "summary": "Community-caretaking stops require objective indications that assistance is needed. A briefly opening passenger door on a moving vehicle did not provide such a basis, making the stop unlawful."
  },
  {
    "caseId": "2024_02766",
    "summary": "Parole officers had a rational, duty-related basis to search defendant’s residence after receiving a report of a firearm and obtaining consent from a co-occupant. The parole search was therefore valid."
  },
  {
    "caseId": "2024_02767",
    "summary": "Parolees retain Fourth Amendment protections, and searches must be substantially related to parole duties. The People failed to show that relationship for the pocket search, requiring suppression."
  },
  {
    "caseId": "2024_02768",
    "summary": "After a prima facie Batson showing, the prosecutor offered no race-neutral explanation for striking a prospective juror. That failure established an equal-protection violation."
  },
  {
    "caseId": "2024_02842",
    "summary": "Before Boone, a cross-racial identification instruction was discretionary rather than mandatory. Counsel’s failure to request the instruction in a pre-Boone trial did not amount to ineffective assistance."
  },
  {
    "caseId": "2024_02843",
    "summary": "The claim that counsel was ineffective for failing to impeach a detective with a prior inconsistent statement depended on trial strategy outside the record. The direct-appeal record was therefore inadequate to resolve the claim."
  },
  {
    "caseId": "2024_03200",
    "summary": "The admission of testimony recounting the victim’s daughter’s statements violated the Confrontation Clause, but the error was harmless under the constitutional standard. The case was returned to the Appellate Division to address issues it had not reached."
  },
  {
    "caseId": "2024_03318",
    "summary": "The trial court abused its discretion by precluding psychiatric evidence under CPL 250.10 in an arson case involving longstanding mental illness. That evidence was central to the defense and should have been admitted."
  },
  {
    "caseId": "2024_03319",
    "summary": "A traffic stop that facilitated a parole search raised a question of unreasonable prolongation, but the lower courts applied the wrong legal standard. The suppression issue was remitted for proper analysis."
  },
  {
    "caseId": "2024_03320",
    "summary": "Record support existed for the prosecution’s race-neutral reasons under Batson, and the showup identifications were not unduly suggestive. Both challenges were rejected on the limited standard of review."
  },
  {
    "caseId": "2024_03322",
    "summary": "The 2020 CPL discovery and readiness amendments did not invalidate a readiness statement made before their effective date. The earlier declaration of readiness remained legally operative."
  },
  {
    "caseId": "2024_03379",
    "summary": "SORA does not credit a registrant’s time registered in another state toward New York’s registration period for level one offenders. The New York registration term runs independently."
  },
  {
    "caseId": "2024_05132",
    "summary": "Defendant’s exclusion from a conference on the prosecution’s motion to cross-examine him about prior conduct violated his right to be present. The later proceeding did not allow meaningful participation and failed to cure the error."
  },
  {
    "caseId": "2024_05175",
    "summary": "There is no bright-line requirement that a court advise a defendant of maximum sentencing exposure in years before allowing self-representation. The record showed an adequate understanding of the risks and disadvantages of proceeding pro se."
  },
  {
    "caseId": "2024_05176",
    "summary": "Monitoring a pro se defendant’s jail calls to witnesses did not, under the circumstances, infringe the constitutional right to present a defense. No reversible constitutional violation was shown."
  },
  {
    "caseId": "2024_05178",
    "summary": "Mental Hygiene Law § 10.11 (d) (4), which allows temporary confinement of SIST supervisees upon a judicial probable-cause finding, satisfies procedural due process. The scheme adequately balances public safety and individual liberty interests."
  },
  {
    "caseId": "2024_05242",
    "summary": "Consecutive sentences for larceny and forgery were permissible because the crimes arose from distinct acts and neither offense was a material element of the other under Penal Law § 70.25 (2)."
  },
  {
    "caseId": "2024_05243",
    "summary": "Counsel’s failure to pursue a knock-and-announce suppression motion was not a clear-cut, dispositive omission beyond strategic explanation. The ineffective-assistance claim therefore failed."
  },
  {
    "caseId": "2024_05244",
    "summary": "The Appellate Division’s weight-of-the-evidence review in a circumstantial-evidence case applied the correct principles. No error was shown in its analysis."
  },
  {
    "caseId": "2024_05817",
    "summary": "The trial court should have instructed the jury on justification for the murder count, given evidence supporting self-defense. That omission also tainted the related weapon-possession count."
  },
  {
    "caseId": "2024_05818",
    "summary": "Assuming a Bruton violation from a codefendant’s statement, the error was harmless in light of overwhelming eyewitness evidence. The verdict did not depend on the challenged statement."
  },
  {
    "caseId": "2024_05819",
    "summary": "The Appellate Division’s suppression ruling on defendant’s statement was erroneous, and it could have affected his decision to plead guilty. On this record, harmlessness could not be established."
  },
  {
    "caseId": "2024_05871",
    "summary": "The coram nobis appeal raised no issues preserved below and thus presented no reviewable claims. Defendant remains free to file a new coram nobis application on properly raised grounds."
  },
  {
    "caseId": "2024_05873",
    "summary": "In a SORA modification proceeding, the court could reduce a level three designation to level two based on the record while declining further reduction. The modification ruling was a discretionary, risk-focused determination."
  },
  {
    "caseId": "2024_05874",
    "summary": "Admission of expert testimony on eyewitness reliability is discretionary and depends on evidentiary rules, not a corroboration threshold. The trial court could limit the expert to cross-race effect where other topics lacked support or were untimely presented."
  },
  {
    "caseId": "2024_06236",
    "summary": "The challenge to the collective showup identification was unpreserved, and no other reversible error was demonstrated."
  },
  {
    "caseId": "2024_06237",
    "summary": "The claim that the initial stop constituted a level-four encounter was unpreserved for appellate review."
  },
  {
    "caseId": "2024_06238",
    "summary": "The officer’s mistaken belief that U-turns were prohibited did not supply probable cause for the stop. Evidence from the stop was therefore subject to suppression."
  },
  {
    "caseId": "2024_06384",
    "summary": "Repeated fog-line crossings in a short time and distance provided probable cause for the DWI stop. The legal-sufficiency challenge failed, and the weight-of-evidence claim was not reviewable."
  },
  {
    "caseId": "2024_06385",
    "summary": "The trial court acted within its discretion in trying two murders together and in denying severance. A disclosed business relationship between defense counsel and an ADA created a potential conflict, but the record showed it did not operate on the defense; other claims lacked merit or were unreviewable."
  }
]
