[
  {
    "caseId": "2004_00097",
    "summary": "Reasonable suspicion determination was a mixed question of law and fact supported by the record and therefore beyond further review."
  },
  {
    "caseId": "2004_00098",
    "summary": "People's appeal dismissed because the Appellate Division reversal was not on the law alone or the law and facts."
  },
  {
    "caseId": "2004_00958",
    "summary": "Extreme emotional disturbance defense was properly rejected because defendant's offer of proof was insufficient, and the court did not reach the notice question. Felony murder sufficiency claim lacked merit; convictions affirmed."
  },
  {
    "caseId": "2004_00959",
    "summary": "Compelled photographs of defendant's tattoos were non-testimonial physical characteristics and did not violate the Fifth Amendment."
  },
  {
    "caseId": "2004_01056",
    "summary": "Victim's complaint qualified as a prompt outcry given the circumstances, and summation objections did not warrant reversal."
  },
  {
    "caseId": "2004_01143",
    "summary": "Jury unanimity was not required between command and actual-killer theories, and the confession was voluntary with door-opening permitting other-crimes statements. Death sentence was vacated and case remitted for resentencing; judgment otherwise affirmed."
  },
  {
    "caseId": "2004_02259",
    "summary": "After the first round of jury selection, the court had discretion to seat one prospective juror at a time; the procedure was lawful though inefficient."
  },
  {
    "caseId": "2004_02260",
    "summary": "Point-blank shooting was a quintessentially intentional attack, making depraved indifference murder legally unsupportable. Appellate Division reversal of the murder conviction was affirmed."
  },
  {
    "caseId": "2004_02293",
    "summary": "Sentencing courts have discretion to allow more than one victim impact statement, and no abuse occurred here."
  },
  {
    "caseId": "2004_02294",
    "summary": "A defendant may request a supporting deposition when ticketed, and the 30-day period runs from the request; service 39 days later was untimely. County Court's dismissal was affirmed."
  },
  {
    "caseId": "2004_02428",
    "summary": "Expert police testimony on drug packaging and quantity was properly admitted to show intent to sell."
  },
  {
    "caseId": "2004_02429",
    "summary": "Expert testimony about money-handling in multi-member drug operations was improper in a single-transaction case, but the error was harmless."
  },
  {
    "caseId": "2004_02514",
    "summary": "Defense counsel's testimony against his client at a Sirois hearing created a conflict requiring reversal. New trial ordered."
  },
  {
    "caseId": "2004_02515",
    "summary": "Under the door-opening doctrine, cross-examination about one identification allowed admission of another otherwise inadmissible identification. No abuse of discretion; order affirmed."
  },
  {
    "caseId": "2004_02516",
    "summary": "Lineup identifications were not suppressed despite a Payton violation because exclusion was not required under the circumstances."
  },
  {
    "caseId": "2004_03507",
    "summary": "A parent can invoke a juvenile's right to counsel, but did not do so here."
  },
  {
    "caseId": "2004_03511",
    "summary": "The meaningful-representation standard applies to ineffective assistance of appellate counsel, and counsel met that standard. Coram nobis denial affirmed."
  },
  {
    "caseId": "2004_03707",
    "summary": "Permanent orders of protection issued at sentencing are appealable, but defendant's claims were unpreserved; Appellate Division affirmed. The People's appeal was dismissed for lack of jurisdiction."
  },
  {
    "caseId": "2004_03714",
    "summary": "The court's supplemental instruction to a deadlocked jury was coercive and unbalanced. Appellate Division's reversal was affirmed."
  },
  {
    "caseId": "2004_03858",
    "summary": "During execution of arrest warrants, a limited security inquiry of defendant was reasonable, and suppression was properly denied."
  },
  {
    "caseId": "2004_04411",
    "summary": "Defendant's dissatisfaction and strategic disagreements with assigned counsel did not require substitution."
  },
  {
    "caseId": "2004_04435",
    "summary": "A grand jury must formally vote with 12 jurors to dismiss a charge; a failure to indict is not a dismissal. Indictment reinstated; order affirmed."
  },
  {
    "caseId": "2004_04439",
    "summary": "Single eyewitness identification was not incredible as a matter of law and sufficed to support the conviction."
  },
  {
    "caseId": "2004_04785",
    "summary": "Arrest at the doorway or after defendant exited his home did not violate Payton, and the codefendant statement was admitted for state of mind, not truth."
  },
  {
    "caseId": "2004_04788",
    "summary": "Signing one's own name to a corporate check without authority is not forgery; authority and authenticity are distinct. Conviction reversed and indictment dismissed."
  },
  {
    "caseId": "2004_04789",
    "summary": "Alleged defects in the issuance of an order of protection were nonjurisdictional and forfeited by a guilty plea. Conviction affirmed."
  },
  {
    "caseId": "2004_05484",
    "summary": "The death-penalty deadlock instruction rendered the statute unconstitutional, requiring vacatur of the death sentence and remittal for noncapital sentencing. Convictions were otherwise affirmed."
  },
  {
    "caseId": "2004_05487",
    "summary": "Officer reasonably detained a taxi passenger to verify suspected fare evasion."
  },
  {
    "caseId": "2004_05559",
    "summary": "The record as a whole showed a knowing, voluntary and intelligent waiver of counsel."
  },
  {
    "caseId": "2004_07399",
    "summary": "The sentencing court conducted a sufficient inquiry into violation of the plea agreement, and defendant admitted the violations."
  },
  {
    "caseId": "2004_07406",
    "summary": "A point-blank shooting was intentional, making depraved indifference murder legally insufficient. Order reversed and indictment dismissed."
  },
  {
    "caseId": "2004_07407",
    "summary": "Defendant's refusal to permit counsel to participate did not bar the court from proceeding; no Sixth Amendment violation occurred."
  },
  {
    "caseId": "2004_07523",
    "summary": "A licensed physician may be prosecuted for aiding and abetting unlicensed practice of medicine; evidence and jury-note response were sufficient."
  },
  {
    "caseId": "2004_07526",
    "summary": "Arthur rule did not apply because the interrogating police were not informed of representation. Statements were admissible; order affirmed."
  },
  {
    "caseId": "2004_08595",
    "summary": "Evidence suggesting defendant possessed a stolen car (a charge dismissed by the grand jury) was unfairly prejudicial and not harmless. New trial ordered."
  },
  {
    "caseId": "2004_08597",
    "summary": "Anonymous undercover testimony was admitted without the required Stanard showing, violating confrontation rights. Conviction reversed and new trial ordered."
  },
  {
    "caseId": "2004_08783",
    "summary": "Admission of the alibi notice was error where the defense presented a new, unnoticed alibi, but the error was harmless given overwhelming evidence."
  },
  {
    "caseId": "2004_08786",
    "summary": "Defendant's signature on an order of protection adequately alleged knowledge for a criminal contempt information. Appellate Term reversed; case remitted."
  },
  {
    "caseId": "2004_08981",
    "summary": "Multiple homicides committed in a continuous course of conduct constituted the same criminal transaction for first-degree murder. Conviction affirmed."
  },
  {
    "caseId": "2004_08982",
    "summary": "Upon resentencing after a mistaken predicate-felon adjudication, the People may allege a different predicate, but cannot withdraw consent to the plea if predicate status fails."
  },
  {
    "caseId": "2004_08984",
    "summary": "Sidebar during defendant's testimony concerned a legal issue and was not a Sandoval or Ventimiglia hearing; no right-to-be-present violation."
  },
  {
    "caseId": "2004_09322",
    "summary": "Judicial-bias claim was unpreserved, and counsel was not ineffective regarding corroboration of defendant's confession."
  },
  {
    "caseId": "2004_09323",
    "summary": "The castle-doctrine exception to the duty to retreat applies even when assailant and defender share the dwelling."
  },
  {
    "caseId": "2004_09404",
    "summary": "Record was insufficient to decide diligence under Parris for missing minutes; case remitted to determine diligence and whether a reconstruction hearing is required. Order reversed and remitted."
  },
  {
    "caseId": "2004_09408",
    "summary": "Loss of minutes did not warrant reversal; reconstruction hearings were denied absent reasonable diligence or, after a guilty plea, identification of appealable issues."
  }
]
