[
  {
    "caseId": "2023_00691",
    "summary": "A jail call was intercepted via wiretap and later obtained from the jail’s consensual recording system. The Court held that CPL 700.70 notice requirements still apply to evidence derived from the wiretap, even if the same call was incidentally recorded elsewhere. Without timely notice, the recording and its fruits are inadmissible."
  },
  {
    "caseId": "2023_00692",
    "summary": "Visible shackling during the jury’s verdict and polling requires an individualized, on-the-record justification. Ordering handcuffs without such findings violates due process under Deck. The error was not harmless."
  },
  {
    "caseId": "2023_00802",
    "summary": "The ineffective-assistance claims were not established on this record and largely depended on matters outside the record. Challenges to the trial court’s inquiry of a juror were unpreserved."
  },
  {
    "caseId": "2023_01352",
    "summary": "The Court declined to discard the Miller/Rodawald rule limiting proof of a victim’s prior violent acts in justification cases unless the defendant knew of those acts at the time. Evidence of the victim’s youthful offender adjudications was therefore properly excluded for proving initial aggression. The existing exception for known acts or reputation evidence remained intact."
  },
  {
    "caseId": "2023_01353",
    "summary": "The People waited years to indict despite having an identified suspect and readily available DNA proof. That unexplained preindictment delay violated the state constitutional due-process right to prompt prosecution. The remedy required dismissal of the indictment."
  },
  {
    "caseId": "2023_01467",
    "summary": "The appeal was dismissed as moot because the issues no longer presented a live controversy. The Court applied its settled mootness doctrine for criminal appeals."
  },
  {
    "caseId": "2023_01468",
    "summary": "The case was remitted for the Appellate Term to clarify and exercise its authority to review a fine for being unduly harsh or severe. The Court emphasized the intermediate appellate court’s plenary sentencing review power under CPL 470.15 (6) (b)."
  },
  {
    "caseId": "2023_02029",
    "summary": "A CPL 440.10 motion based on “newly discovered” text messages and photos failed because the evidence was available before trial and was not newly discovered. The summary denial was not an abuse of discretion."
  },
  {
    "caseId": "2023_02030",
    "summary": "A superior court information filed after a grand jury indictment failed to satisfy CPL 195.10’s strict prerequisites. Because the SCI was a nullity, the plea based on it was jurisdictionally defective."
  },
  {
    "caseId": "2023_02734",
    "summary": "Police lacked reasonable suspicion to conduct a level-three stop and frisk under De Bour. The resulting seizure and recovery of contraband were unlawful, requiring suppression."
  },
  {
    "caseId": "2023_02735",
    "summary": "The aggravated family offense count was jurisdictionally defective and had to be dismissed. The remaining criminal contempt conviction stood because the ineffective-assistance claim was not shown on this record."
  },
  {
    "caseId": "2023_02736",
    "summary": "The evidence of physical injury was legally sufficient for second-degree assault, based on testimony of pain, bleeding, swelling, and hospital records. The case was returned to the Appellate Division to address remaining issues it had not reached."
  },
  {
    "caseId": "2023_02755",
    "summary": "A full courtroom closure requires specific, on-the-record findings under Waller. Closing the courtroom for several trial days without an evidentiary inquiry violated the Sixth Amendment public-trial right."
  },
  {
    "caseId": "2023_02756",
    "summary": "A judge cannot delegate responsibility for public-trial limitations to court staff without ensuring constitutional compliance. Excluding the public during witness testimony pursuant to a blanket policy violated the public-trial right."
  },
  {
    "caseId": "2023_03186",
    "summary": "The trial court recognized defendant’s unequivocal request to proceed pro se but failed to conduct the required searching inquiry. Without that inquiry, the waiver of counsel was invalid."
  },
  {
    "caseId": "2023_03187",
    "summary": "A stun belt was imposed without a particularized, on-the-record need, contrary to Buchanan, but the claim was not a mode-of-proceedings error. The ineffective-assistance claim required further factual development, so remittal for a hearing was necessary."
  },
  {
    "caseId": "2023_03298",
    "summary": "The SARA school-grounds restriction applies to youthful offenders. The statute’s mandatory condition turns on the offense and sentence status, not the youthful-offender designation."
  },
  {
    "caseId": "2023_03299",
    "summary": "Applying SARA’s school-grounds restriction to offenders whose crimes predated the 2005 amendments does not violate the Ex Post Facto Clause. The petitioner failed to show, by the clearest proof, that the law is punitive in effect."
  },
  {
    "caseId": "2023_03300",
    "summary": "SORA requires notice and an opportunity to be heard before an upward departure from the presumptive risk level. An upward departure imposed without notice or a chance to contest the basis violated due process."
  },
  {
    "caseId": "2023_03301",
    "summary": "The Appellate Division may remit for consideration of an upward departure in a SORA case even if the People did not request that departure below. The remittal was within the court’s authority on the record presented."
  },
  {
    "caseId": "2023_03303",
    "summary": "A SORA downward-departure request was denied where the Board’s risk assessment and record supported a level-three designation. The defendant’s program participation and other mitigation were insufficient to warrant a reduced risk level."
  },
  {
    "caseId": "2023_05305",
    "summary": "The trial court misapplied the Rape Shield Law to exclude forensic evidence suggesting another source of the complainant’s injuries. That exclusion deprived defendant of the right to present a defense."
  },
  {
    "caseId": "2023_05306",
    "summary": "In a misdemeanor assault case, an eight-day adjournment was chargeable to the People because defendant was not “without counsel” when substitute counsel appeared. The 90-day CPL 30.30 time limit was exceeded."
  },
  {
    "caseId": "2023_05348",
    "summary": "CPL 30.30 (1) (e) applies to traffic infractions, so the speedy-trial statute covered the simplified traffic information. The People’s reliance on Galindo did not create a new-law exception."
  },
  {
    "caseId": "2023_05350",
    "summary": "The NYPD’s standardized inventory-search protocol was constitutionally valid on its face. Defendant did not overcome the People’s proof establishing a lawful inventory search."
  },
  {
    "caseId": "2023_05956",
    "summary": "Autopsy reports admitted through a non-performing expert violated the Confrontation Clause. The error was nonetheless harmless given the proof at trial."
  },
  {
    "caseId": "2023_05957",
    "summary": "DNA evidence requires testimony from the analyst who created the DNA profiles at the interpretive “editing” stage. The record did not establish that the proper witness testified, creating a Confrontation Clause violation."
  },
  {
    "caseId": "2023_05963",
    "summary": "After a lawful traffic stop, the officer’s observations and defendant’s inconsistent answers supported a founded suspicion to request consent to search the car. The De Bour analysis turned on credibility findings supported by the record."
  },
  {
    "caseId": "2023_05964",
    "summary": "Counsel failed to request the only defense charge supported by the trial evidence and instead pursued a legally unavailable charge. That single error deprived defendant of meaningful representation."
  },
  {
    "caseId": "2023_05965",
    "summary": "Second Amendment challenges to Penal Law § 265.03 were unpreserved. The trial court’s admission of Molineux prior-bad-acts evidence and propensity summation arguments was erroneous and prejudicial."
  },
  {
    "caseId": "2023_05966",
    "summary": "At a parade-day checkpoint, officers smelled marijuana, searched the car, and recovered a firearm. Defendant’s appellate claims were either unpreserved or lacked merit, including challenges to the stop and search."
  },
  {
    "caseId": "2023_05967",
    "summary": "The sentencing court exercised discretion in determining youthful-offender eligibility after a predicate conviction was vacated. New Bruen-based eligibility arguments raised for the first time on appeal were unpreserved."
  },
  {
    "caseId": "2023_05968",
    "summary": "Bruen-based constitutional challenges to Penal Law § 265.03 were unpreserved. The record showed that defendant was in custody when handcuffed and questioned, triggering Miranda."
  },
  {
    "caseId": "2023_05969",
    "summary": "Limits on voir dire questioning did not deprive defendant of a fair trial, and Eighth Amendment/COVID-based sentencing claims failed. Bruen challenges raised for the first time were unpreserved."
  },
  {
    "caseId": "2023_05970",
    "summary": "Challenges to an inventory search and alleged prejudicial trial testimony did not warrant relief. Bruen-based constitutional claims to the firearm statute were unpreserved."
  },
  {
    "caseId": "2023_05971",
    "summary": "The ineffective-assistance claim based on an unraised Confrontation Clause challenge to DNA reports was not a clear-cut, dispositive omission. The record did not foreclose a strategic explanation."
  },
  {
    "caseId": "2023_05972",
    "summary": "Stopping a bicyclist is a seizure that requires reasonable suspicion of crime or probable cause of a traffic violation. The officers lacked that justification, making the stop unlawful."
  },
  {
    "caseId": "2023_05973",
    "summary": "A nonsexual crime triggered SORA registration despite the absence of sexual conduct or risk. Applying SORA in this as-applied context violated due process and did not further the statute’s protective purpose."
  },
  {
    "caseId": "2023_05974",
    "summary": "Officers entered a residence and apartment after a door was opened, but the record did not establish valid consent to enter. The warrantless entry and arrest required suppression."
  },
  {
    "caseId": "2023_06404",
    "summary": "First-time, in-court identifications require early notice so the defense can request alternative procedures. Trial courts must balance probative value against misidentification risks and may craft protective measures when requested."
  },
  {
    "caseId": "2023_06407",
    "summary": "The People filed a certificate of compliance without exercising due diligence to identify and disclose mandatory discovery. The belated disclosures rendered the certificate improper and the readiness statement illusory for CPL 30.30 purposes."
  },
  {
    "caseId": "2023_06468",
    "summary": "A narcotics-detection dog sniff of a person’s body is a search under the Fourth Amendment. Such a sniff therefore requires constitutional justification."
  }
]
